#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on eks.tf line 192, in resource "aws_launch_template" "eks_launch_template":
 192: resource "aws_launch_template" "eks_launch_template" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_version is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ssm_parameter.foo: Refreshing state... [id=foo]
aws_iam_role.eks_cluster: Refreshing state... [id=num-mgmt-prod-eks-cluster-role]
aws_iam_role.eks_nodes: Refreshing state... [id=num-mgmt-prod-eks-node-group]
data.aws_ami.amazon_linux_2: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-0dccce2def3e421c1]
aws_eip.nat: Refreshing state... [id=eipalloc-0947d78f71064e666]
aws_iam_role.ec2_role: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=num-mgmt-prod-eks-cluster-role-20250810054908148100000009]
aws_iam_role_policy_attachment.AmazonEKSServicePolicy: Refreshing state... [id=num-mgmt-prod-eks-cluster-role-2025081005490822880000000e]
aws_iam_role_policy_attachment.AmazonSQSFullAccess: Refreshing state... [id=num-mgmt-prod-eks-cluster-role-2025081005490824080000000f]
aws_iam_role_policy_attachment.eks_service: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908039700000004]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2-eks-ssm-profile]
aws_iam_role_policy_attachment.eks: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908042000000005]
aws_iam_role_policy_attachment.ssm: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054907983400000002]
aws_iam_role_policy_attachment.s3_full: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908018200000003]
aws_iam_role_policy_attachment.ec2_full: Refreshing state... [id=ec2-eks-ssm-s3-fullaccess-role-20250810054908050600000006]
aws_iam_role_policy_attachment.AmazonSQSFull-Access: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490820020000000c]
aws_iam_role_policy_attachment.AmazonS3FullAccess: Refreshing state... [id=num-mgmt-prod-eks-node-group-20250810054908051700000007]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490821070000000d]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490816790000000b]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=num-mgmt-prod-eks-node-group-20250810054908142800000008]
aws_iam_role_policy.sm_policy: Refreshing state... [id=num-mgmt-prod-eks-node-group:SecretsManager_readaccess]
aws_iam_role_policy_attachment.AmazonSSMFullAccess: Refreshing state... [id=num-mgmt-prod-eks-node-group-2025081005490816560000000a]
data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-0e2c86481225d3c51]
aws_subnet.public_subnet_a: Refreshing state... [id=subnet-081111dbb9db6661f]
aws_security_group.eks_cluster: Refreshing state... [id=sg-045ba040e4cb7e4b7]
aws_internet_gateway.igw: Refreshing state... [id=igw-0dbe72316e94e12c8]
aws_subnet.private_subnet_b: Refreshing state... [id=subnet-08c714e253cccc4d1]
aws_security_group.eks_node: Refreshing state... [id=sg-07feb1532b5399ea0]
aws_subnet.public_subnet_b: Refreshing state... [id=subnet-0b4c8efc990bb9b1f]
aws_subnet.private_subnet_a: Refreshing state... [id=subnet-0a72ac9c2aeb1965f]
aws_security_group.ec2_sg: Refreshing state... [id=sg-08174a940d31cd9fc]
aws_route_table.public_route_table: Refreshing state... [id=rtb-074e9e38d017fadcd]
aws_nat_gateway.nat: Refreshing state... [id=nat-046571b836929ec16]
aws_security_group_rule.cluster_inbound_subnet: Refreshing state... [id=sgrule-3343027942]
aws_route_table.private: Refreshing state... [id=rtb-0bcfb2d0bb3529d68]
aws_route_table_association.public_rt_a: Refreshing state... [id=rtbassoc-0e3a0977f2ae3d9b9]
aws_instance.ec2_instance: Refreshing state... [id=i-0111f5339bfe59c07]
aws_security_group_rule.node_outbound_node: Refreshing state... [id=sgrule-3992475341]
aws_security_group_rule.cluster_outbound: Refreshing state... [id=sgrule-2951571548]
aws_security_group_rule.node_inbound_node_extension: Refreshing state... [id=sgrule-192312478]
aws_security_group_rule.node_inbound_node: Refreshing state... [id=sgrule-1032294380]
aws_security_group_rule.node_outbound_master: Refreshing state... [id=sgrule-1291749790]
aws_security_group_rule.node_outbound_internet: Refreshing state... [id=sgrule-533721454]
aws_security_group_rule.cluster_inbound: Refreshing state... [id=sgrule-4216858635]
aws_security_group_rule.cluster_outbound_node: Refreshing state... [id=sgrule-1048970231]
aws_security_group_rule.node_inbound_master: Refreshing state... [id=sgrule-4062072762]
aws_security_group_rule.node_inbound_webhooks: Refreshing state... [id=sgrule-3228027420]
aws_eks_cluster.aws_eks: Refreshing state... [id=mgmt-eks-cluster]
aws_route_table_association.public_rt_b: Refreshing state... [id=rtbassoc-0208e290fc4311bd6]
aws_route_table_association.private_rt_b: Refreshing state... [id=rtbassoc-01d04bfc705bc16b1]
aws_route_table_association.private_rt_a: Refreshing state... [id=rtbassoc-03aa0dc3e14d0cfd2]
aws_eks_addon.coredns: Refreshing state... [id=mgmt-eks-cluster:coredns]
aws_eks_addon.kube-proxy: Refreshing state... [id=mgmt-eks-cluster:kube-proxy]
data.tls_certificate.cluster[0]: Reading...
aws_eks_addon.vpc-cni: Refreshing state... [id=mgmt-eks-cluster:vpc-cni]
data.tls_certificate.cluster[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
aws_iam_openid_connect_provider.default[0]: Refreshing state... [id=arn:aws:iam::992382441132:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/F3676C777A80F8BCB373CC6E5EA0C3BE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "mgmt-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "num-mgmt-prod-node"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::992382441132:role/num-mgmt-prod-eks-node-group"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-08c714e253cccc4d1",
          + "subnet-0a72ac9c2aeb1965f",
        ]
      + tags                   = {
          + "Name" = "mgmt-eks-node"
        }
      + tags_all               = {
          + "Name" = "mgmt-eks-node"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = "prod_eks_launch_template"
          + version = (known after apply)
        }

      + node_repair_config {
          + enabled = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # aws_launch_template.eks_launch_template will be created
  + resource "aws_launch_template" "eks_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-02e60ceca69eedf91"
      + latest_version  = (known after apply)
      + name            = "prod_eks_launch_template"
      + name_prefix     = (known after apply)
      + tags_all        = (known after apply)
      + user_data       = "IyEvYmluL2Jhc2gKL2V0Yy9la3MvYm9vdHN0cmFwLnNoIC0tYXBpc2VydmVyLWVuZHBvaW50IGh0dHBzOi8vRjM2NzZDNzc3QTgwRjhCQ0IzNzNDQzZFNUVBMEMzQkUuZ3I3LnVzLWVhc3QtMS5la3MuYW1hem9uYXdzLmNvbSAtLWI2NC1jbHVzdGVyLWNhIExTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJDVkVORFFXVXlaMEYzU1VKQlowbEpSM1ZyV0RCclZGSmFOR3QzUkZGWlNrdHZXa2xvZG1OT1FWRkZURUpSUVhkR1ZFVlVUVUpGUjBFeFZVVUtRWGhOUzJFelZtbGFXRXAxV2xoU2JHTjZRV1ZHZHpCNVRsUkJORTFVUVhkT1ZGRTFUVlJXWVVaM01IcE9WRUUwVFVSbmQwNVVWVEJOVkZaaFRVSlZlQXBGZWtGU1FtZE9Wa0pCVFZSRGJYUXhXVzFXZVdKdFZqQmFXRTEzWjJkRmFVMUJNRWREVTNGSFUwbGlNMFJSUlVKQlVWVkJRVFJKUWtSM1FYZG5aMFZMQ2tGdlNVSkJVVVJOY3pFeU1WbEVNelZtVldOVFIyVnZaRzV2YVhsU2JVcHVVbFo2WlRkbFNERlRVa0p1WjJGTVV6QldWVTE2YkVwSVJqRlJNRUZQVHpVS2R6Wk9XRlZWTUcxT09GUkVVVUZpTTJKWGNtWlNhMFoyV2xWaFYyaHZRVk15VXpGTFFrTm9WbEpHY0VOMU1XRlVZelE1ZG5GTGVYcDZTelpLTjBSMVR3b3phVmhYWm1SSlRFZzNNV3N4SzJ0RVIyMUlOMUZUVlhaRk5uRkRhakJYVDNOMGNESjZVbTVyVW5CTVUwRmFWRFpRUlU5MWJtVXJURTltYTNaU01XZHZDa2huVlhkTE1rMXlaazV4YUc5UGFrOUhOMlJ5VUdWSlRsSllhRTk0TDNZdlJHdHpUWEYwWlN0VmJGTklTMDlZYTNsVVYzbHBkRTR2ZEdOTlVrd3phVm9LZDFKR09HTnpUSFpsZUZFdmR6ZEZPRmRDUVdNeGRGY3pkRVY0TWpWbVNuTnpNRk5ZY0ZaRU5EWklhbXQ0U0VZNVNYUjFWRzlUTDFCTFVESmFNVXhqWkFveEswcEJjelZTWnpsNmFXUjBlVE5SZW14TE9XeHVaWGhTVVdSVVFXZE5Ra0ZCUjJwWFZFSllUVUUwUjBFeFZXUkVkMFZDTDNkUlJVRjNTVU53UkVGUUNrSm5UbFpJVWsxQ1FXWTRSVUpVUVVSQlVVZ3ZUVUl3UjBFeFZXUkVaMUZYUWtKVVJWYzBOa2xFUnpVek9WRlBRa3AzVVN0REwxaDFUbVJWYTNSRVFWWUtRbWRPVmtoU1JVVkVha0ZOWjJkd2NtUlhTbXhqYlRWc1pFZFdlazFCTUVkRFUzRkhVMGxpTTBSUlJVSkRkMVZCUVRSSlFrRlJRMlV2WTJzdlZWTnlTZ3BQVlVGQ2NtNUxUa3RES3pKeU5HNXljM0kxYW1OaGFHWktlVUUyUVdrelpEWlBkVWxJZDI5emVtUnFNbTVrV1hkcmVUSmhUVXBVYWt4ME5GWm1RVVZqQ25wNWNEbG5TMmhNUTJSMGJDOXdUVkF2UkdWbVdtYzJSV293YVUwd2VFdDFla3BrYldoRU16ZEdLM3AzU2xKdldrTTFiMkV4VVRoR09XVjJaV2N5V0U0S1UwVkpTbmhyY0c5c2FYWTBRVUZOUm5WbGIyMHpSbU5OWmtseGVucEdUWHBQY25oNWJWYzNNa2hSWldkeWRqUm1TRmRhZW5wSlkyZ3plRVJSTkdJMU1RcFJiekI0VFZJM1ExRmxSVXBZSzBkTmMyOUdMemxtWkZwUFZsUTFWR05tZDJaRFUzVTBRVFoxVDBVemFrMXBWaklyWjJ4MVFYVjZibk50WmpoNFJuVjZDazlzZHpkUFpHVlljR1l4UldOaGFrNWxMMHRsZWxoU1FXcEhiMHQ0Tm5WTFVVZDFPVTF2ZDFSdGFGcE5hbXRzVVZsbGRGTjNOa0ZsUVdoVlVrZFNja3dLTkdaTmFraHJZelJXV0dsMENpMHRMUzB0UlU1RUlFTkZVbFJKUmtsRFFWUkZMUzB0TFMwSyBtZ210LWVrcy1jbHVzdGVyCnl1bSAteSB1cGRhdGUgLS1zZWN1cml0eQ=="

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "CreatedBy" = "Terraform"
            }
        }
    }

  # aws_ssm_parameter.foo will be destroyed
  # (because aws_ssm_parameter.foo is not in configuration)
  - resource "aws_ssm_parameter" "foo" {
      - arn       = "arn:aws:ssm:us-east-1:992382441132:parameter/foo" -> null
      - data_type = "text" -> null
      - id        = "foo" -> null
      - name      = "foo" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value)
      - version   = 1 -> null
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Redundant ignore_changes element

  on eks.tf line 192, in resource "aws_launch_template" "eks_launch_template":
 192: resource "aws_launch_template" "eks_launch_template" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_version is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anuragrai63, Action: `pull_request`*